_________________________________________________________________
Layer (type)                 Output Shape              Param #
=================================================================
input_1 (InputLayer)         (None, 224, 224, 3)       0
_________________________________________________________________
inception_resnet_v2 (Model)  (None, 1536)              54336736
_________________________________________________________________
dense_1 (Dense)              (None, 4)                 6148
=================================================================
Total params: 54,342,884
Trainable params: 4,136,740
Non-trainable params: 50,206,144
_________________________________________________________________
 